In [1]:
import pandas as pd
file_name = "https://people.sc.fsu.edu/~jburkardt/data/csv/homes.csv"
df = pd.read_csv(file_name)

In [2]:
df.head()

,Sell,"""List""","""Living""","""Rooms""","""Beds""","""Baths""","""Age""","""Acres""","""Taxes"""
0,142,160,28,10,5,3,60,0.28,3167
1,175,180,18,8,4,1,12,0.43,4033
2,129,132,13,6,3,1,41,0.33,1471
3,138,140,17,7,3,1,22,0.46,3204
4,232,240,25,8,4,3,5,2.05,3613

In [3]:
df.dtypes

Sell           int64
 "List"        int64
 "Living"      int64
 "Rooms"       int64
 "Beds"        int64
 "Baths"       int64
 "Age"         int64
 "Acres"     float64
 "Taxes"       int64
dtype: object

In [8]:
df['Sell'] = df['Sell'].astype(float)

In [9]:
df.head()

,Sell,"""List""","""Living""","""Rooms""","""Beds""","""Baths""","""Age""","""Acres""","""Taxes"""
0,142.0,160,28,10,5,3,60,0.28,3167
1,175.0,180,18,8,4,1,12,0.43,4033
2,129.0,132,13,6,3,1,41,0.33,1471
3,138.0,140,17,7,3,1,22,0.46,3204
4,232.0,240,25,8,4,3,5,2.05,3613

In [9]:
df['Sell'] = pd.to_numeric(df['Sell'])
df.head()

,Sell,"""List""","""Living""","""Rooms""","""Beds""","""Baths""","""Age""","""Acres""","""Taxes"""
0,142,160,28,10,5,3,60,0.28,3167
1,175,180,18,8,4,1,12,0.43,4033
2,129,132,13,6,3,1,41,0.33,1471
3,138,140,17,7,3,1,22,0.46,3204
4,232,240,25,8,4,3,5,2.05,3613